{
  "version": 1,
  "size": 235,
  "tokens": [
    "<PAD>",
    "HAND_START|0-10bb",
    "HAND_START|10-20bb",
    "HAND_START|20-40bb",
    "HAND_START|40-60bb",
    "HAND_START|60-100bb",
    "HAND_START|100-150bb",
    "HAND_START|150-200bb",
    "HAND_START|200bb+",
    "HAND_END",
    "SHOWDOWN",
    "PREFLOP|SB|FOLD",
    "PREFLOP|SB|CHECK",
    "PREFLOP|SB|CALL",
    "PREFLOP|SB|BET|0-10%",
    "PREFLOP|SB|BET|10-25%",
    "PREFLOP|SB|BET|25-40%",
    "PREFLOP|SB|BET|40-60%",
    "PREFLOP|SB|BET|60-80%",
    "PREFLOP|SB|BET|80-100%",
    "PREFLOP|SB|BET|100-150%",
    "PREFLOP|SB|BET|150-200%",
    "PREFLOP|SB|BET|200-300%",
    "PREFLOP|SB|BET|300-500%",
    "PREFLOP|SB|BET|500%+",
    "PREFLOP|SB|BET|ALL_IN",
    "PREFLOP|SB|RAISE|0-10%",
    "PREFLOP|SB|RAISE|10-25%",
    "PREFLOP|SB|RAISE|25-40%",
    "PREFLOP|SB|RAISE|40-60%",
    "PREFLOP|SB|RAISE|60-80%",
    "PREFLOP|SB|RAISE|80-100%",
    "PREFLOP|SB|RAISE|100-150%",
    "PREFLOP|SB|RAISE|150-200%",
    "PREFLOP|SB|RAISE|200-300%",
    "PREFLOP|SB|RAISE|300-500%",
    "PREFLOP|SB|RAISE|500%+",
    "PREFLOP|SB|RAISE|ALL_IN",
    "PREFLOP|SB|ALL_IN",
    "PREFLOP|BB|FOLD",
    "PREFLOP|BB|CHECK",
    "PREFLOP|BB|CALL",
    "PREFLOP|BB|BET|0-10%",
    "PREFLOP|BB|BET|10-25%",
    "PREFLOP|BB|BET|25-40%",
    "PREFLOP|BB|BET|40-60%",
    "PREFLOP|BB|BET|60-80%",
    "PREFLOP|BB|BET|80-100%",
    "PREFLOP|BB|BET|100-150%",
    "PREFLOP|BB|BET|150-200%",
    "PREFLOP|BB|BET|200-300%",
    "PREFLOP|BB|BET|300-500%",
    "PREFLOP|BB|BET|500%+",
    "PREFLOP|BB|BET|ALL_IN",
    "PREFLOP|BB|RAISE|0-10%",
    "PREFLOP|BB|RAISE|10-25%",
    "PREFLOP|BB|RAISE|25-40%",
    "PREFLOP|BB|RAISE|40-60%",
    "PREFLOP|BB|RAISE|60-80%",
    "PREFLOP|BB|RAISE|80-100%",
    "PREFLOP|BB|RAISE|100-150%",
    "PREFLOP|BB|RAISE|150-200%",
    "PREFLOP|BB|RAISE|200-300%",
    "PREFLOP|BB|RAISE|300-500%",
    "PREFLOP|BB|RAISE|500%+",
    "PREFLOP|BB|RAISE|ALL_IN",
    "PREFLOP|BB|ALL_IN",
    "FLOP|SB|FOLD",
    "FLOP|SB|CHECK",
    "FLOP|SB|CALL",
    "FLOP|SB|BET|0-10%",
    "FLOP|SB|BET|10-25%",
    "FLOP|SB|BET|25-40%",
    "FLOP|SB|BET|40-60%",
    "FLOP|SB|BET|60-80%",
    "FLOP|SB|BET|80-100%",
    "FLOP|SB|BET|100-150%",
    "FLOP|SB|BET|150-200%",
    "FLOP|SB|BET|200-300%",
    "FLOP|SB|BET|300-500%",
    "FLOP|SB|BET|500%+",
    "FLOP|SB|BET|ALL_IN",
    "FLOP|SB|RAISE|0-10%",
    "FLOP|SB|RAISE|10-25%",
    "FLOP|SB|RAISE|25-40%",
    "FLOP|SB|RAISE|40-60%",
    "FLOP|SB|RAISE|60-80%",
    "FLOP|SB|RAISE|80-100%",
    "FLOP|SB|RAISE|100-150%",
    "FLOP|SB|RAISE|150-200%",
    "FLOP|SB|RAISE|200-300%",
    "FLOP|SB|RAISE|300-500%",
    "FLOP|SB|RAISE|500%+",
    "FLOP|SB|RAISE|ALL_IN",
    "FLOP|SB|ALL_IN",
    "FLOP|BB|FOLD",
    "FLOP|BB|CHECK",
    "FLOP|BB|CALL",
    "FLOP|BB|BET|0-10%",
    "FLOP|BB|BET|10-25%",
    "FLOP|BB|BET|25-40%",
    "FLOP|BB|BET|40-60%",
    "FLOP|BB|BET|60-80%",
    "FLOP|BB|BET|80-100%",
    "FLOP|BB|BET|100-150%",
    "FLOP|BB|BET|150-200%",
    "FLOP|BB|BET|200-300%",
    "FLOP|BB|BET|300-500%",
    "FLOP|BB|BET|500%+",
    "FLOP|BB|BET|ALL_IN",
    "FLOP|BB|RAISE|0-10%",
    "FLOP|BB|RAISE|10-25%",
    "FLOP|BB|RAISE|25-40%",
    "FLOP|BB|RAISE|40-60%",
    "FLOP|BB|RAISE|60-80%",
    "FLOP|BB|RAISE|80-100%",
    "FLOP|BB|RAISE|100-150%",
    "FLOP|BB|RAISE|150-200%",
    "FLOP|BB|RAISE|200-300%",
    "FLOP|BB|RAISE|300-500%",
    "FLOP|BB|RAISE|500%+",
    "FLOP|BB|RAISE|ALL_IN",
    "FLOP|BB|ALL_IN",
    "TURN|SB|FOLD",
    "TURN|SB|CHECK",
    "TURN|SB|CALL",
    "TURN|SB|BET|0-10%",
    "TURN|SB|BET|10-25%",
    "TURN|SB|BET|25-40%",
    "TURN|SB|BET|40-60%",
    "TURN|SB|BET|60-80%",
    "TURN|SB|BET|80-100%",
    "TURN|SB|BET|100-150%",
    "TURN|SB|BET|150-200%",
    "TURN|SB|BET|200-300%",
    "TURN|SB|BET|300-500%",
    "TURN|SB|BET|500%+",
    "TURN|SB|BET|ALL_IN",
    "TURN|SB|RAISE|0-10%",
    "TURN|SB|RAISE|10-25%",
    "TURN|SB|RAISE|25-40%",
    "TURN|SB|RAISE|40-60%",
    "TURN|SB|RAISE|60-80%",
    "TURN|SB|RAISE|80-100%",
    "TURN|SB|RAISE|100-150%",
    "TURN|SB|RAISE|150-200%",
    "TURN|SB|RAISE|200-300%",
    "TURN|SB|RAISE|300-500%",
    "TURN|SB|RAISE|500%+",
    "TURN|SB|RAISE|ALL_IN",
    "TURN|SB|ALL_IN",
    "TURN|BB|FOLD",
    "TURN|BB|CHECK",
    "TURN|BB|CALL",
    "TURN|BB|BET|0-10%",
    "TURN|BB|BET|10-25%",
    "TURN|BB|BET|25-40%",
    "TURN|BB|BET|40-60%",
    "TURN|BB|BET|60-80%",
    "TURN|BB|BET|80-100%",
    "TURN|BB|BET|100-150%",
    "TURN|BB|BET|150-200%",
    "TURN|BB|BET|200-300%",
    "TURN|BB|BET|300-500%",
    "TURN|BB|BET|500%+",
    "TURN|BB|BET|ALL_IN",
    "TURN|BB|RAISE|0-10%",
    "TURN|BB|RAISE|10-25%",
    "TURN|BB|RAISE|25-40%",
    "TURN|BB|RAISE|40-60%",
    "TURN|BB|RAISE|60-80%",
    "TURN|BB|RAISE|80-100%",
    "TURN|BB|RAISE|100-150%",
    "TURN|BB|RAISE|150-200%",
    "TURN|BB|RAISE|200-300%",
    "TURN|BB|RAISE|300-500%",
    "TURN|BB|RAISE|500%+",
    "TURN|BB|RAISE|ALL_IN",
    "TURN|BB|ALL_IN",
    "RIVER|SB|FOLD",
    "RIVER|SB|CHECK",
    "RIVER|SB|CALL",
    "RIVER|SB|BET|0-10%",
    "RIVER|SB|BET|10-25%",
    "RIVER|SB|BET|25-40%",
    "RIVER|SB|BET|40-60%",
    "RIVER|SB|BET|60-80%",
    "RIVER|SB|BET|80-100%",
    "RIVER|SB|BET|100-150%",
    "RIVER|SB|BET|150-200%",
    "RIVER|SB|BET|200-300%",
    "RIVER|SB|BET|300-500%",
    "RIVER|SB|BET|500%+",
    "RIVER|SB|BET|ALL_IN",
    "RIVER|SB|RAISE|0-10%",
    "RIVER|SB|RAISE|10-25%",
    "RIVER|SB|RAISE|25-40%",
    "RIVER|SB|RAISE|40-60%",
    "RIVER|SB|RAISE|60-80%",
    "RIVER|SB|RAISE|80-100%",
    "RIVER|SB|RAISE|100-150%",
    "RIVER|SB|RAISE|150-200%",
    "RIVER|SB|RAISE|200-300%",
    "RIVER|SB|RAISE|300-500%",
    "RIVER|SB|RAISE|500%+",
    "RIVER|SB|RAISE|ALL_IN",
    "RIVER|SB|ALL_IN",
    "RIVER|BB|FOLD",
    "RIVER|BB|CHECK",
    "RIVER|BB|CALL",
    "RIVER|BB|BET|0-10%",
    "RIVER|BB|BET|10-25%",
    "RIVER|BB|BET|25-40%",
    "RIVER|BB|BET|40-60%",
    "RIVER|BB|BET|60-80%",
    "RIVER|BB|BET|80-100%",
    "RIVER|BB|BET|100-150%",
    "RIVER|BB|BET|150-200%",
    "RIVER|BB|BET|200-300%",
    "RIVER|BB|BET|300-500%",
    "RIVER|BB|BET|500%+",
    "RIVER|BB|BET|ALL_IN",
    "RIVER|BB|RAISE|0-10%",
    "RIVER|BB|RAISE|10-25%",
    "RIVER|BB|RAISE|25-40%",
    "RIVER|BB|RAISE|40-60%",
    "RIVER|BB|RAISE|60-80%",
    "RIVER|BB|RAISE|80-100%",
    "RIVER|BB|RAISE|100-150%",
    "RIVER|BB|RAISE|150-200%",
    "RIVER|BB|RAISE|200-300%",
    "RIVER|BB|RAISE|300-500%",
    "RIVER|BB|RAISE|500%+",
    "RIVER|BB|RAISE|ALL_IN",
    "RIVER|BB|ALL_IN"
  ],
  "token_to_id": {
    "<PAD>": 0,
    "HAND_START|0-10bb": 1,
    "HAND_START|10-20bb": 2,
    "HAND_START|20-40bb": 3,
    "HAND_START|40-60bb": 4,
    "HAND_START|60-100bb": 5,
    "HAND_START|100-150bb": 6,
    "HAND_START|150-200bb": 7,
    "HAND_START|200bb+": 8,
    "HAND_END": 9,
    "SHOWDOWN": 10,
    "PREFLOP|SB|FOLD": 11,
    "PREFLOP|SB|CHECK": 12,
    "PREFLOP|SB|CALL": 13,
    "PREFLOP|SB|BET|0-10%": 14,
    "PREFLOP|SB|BET|10-25%": 15,
    "PREFLOP|SB|BET|25-40%": 16,
    "PREFLOP|SB|BET|40-60%": 17,
    "PREFLOP|SB|BET|60-80%": 18,
    "PREFLOP|SB|BET|80-100%": 19,
    "PREFLOP|SB|BET|100-150%": 20,
    "PREFLOP|SB|BET|150-200%": 21,
    "PREFLOP|SB|BET|200-300%": 22,
    "PREFLOP|SB|BET|300-500%": 23,
    "PREFLOP|SB|BET|500%+": 24,
    "PREFLOP|SB|BET|ALL_IN": 25,
    "PREFLOP|SB|RAISE|0-10%": 26,
    "PREFLOP|SB|RAISE|10-25%": 27,
    "PREFLOP|SB|RAISE|25-40%": 28,
    "PREFLOP|SB|RAISE|40-60%": 29,
    "PREFLOP|SB|RAISE|60-80%": 30,
    "PREFLOP|SB|RAISE|80-100%": 31,
    "PREFLOP|SB|RAISE|100-150%": 32,
    "PREFLOP|SB|RAISE|150-200%": 33,
    "PREFLOP|SB|RAISE|200-300%": 34,
    "PREFLOP|SB|RAISE|300-500%": 35,
    "PREFLOP|SB|RAISE|500%+": 36,
    "PREFLOP|SB|RAISE|ALL_IN": 37,
    "PREFLOP|SB|ALL_IN": 38,
    "PREFLOP|BB|FOLD": 39,
    "PREFLOP|BB|CHECK": 40,
    "PREFLOP|BB|CALL": 41,
    "PREFLOP|BB|BET|0-10%": 42,
    "PREFLOP|BB|BET|10-25%": 43,
    "PREFLOP|BB|BET|25-40%": 44,
    "PREFLOP|BB|BET|40-60%": 45,
    "PREFLOP|BB|BET|60-80%": 46,
    "PREFLOP|BB|BET|80-100%": 47,
    "PREFLOP|BB|BET|100-150%": 48,
    "PREFLOP|BB|BET|150-200%": 49,
    "PREFLOP|BB|BET|200-300%": 50,
    "PREFLOP|BB|BET|300-500%": 51,
    "PREFLOP|BB|BET|500%+": 52,
    "PREFLOP|BB|BET|ALL_IN": 53,
    "PREFLOP|BB|RAISE|0-10%": 54,
    "PREFLOP|BB|RAISE|10-25%": 55,
    "PREFLOP|BB|RAISE|25-40%": 56,
    "PREFLOP|BB|RAISE|40-60%": 57,
    "PREFLOP|BB|RAISE|60-80%": 58,
    "PREFLOP|BB|RAISE|80-100%": 59,
    "PREFLOP|BB|RAISE|100-150%": 60,
    "PREFLOP|BB|RAISE|150-200%": 61,
    "PREFLOP|BB|RAISE|200-300%": 62,
    "PREFLOP|BB|RAISE|300-500%": 63,
    "PREFLOP|BB|RAISE|500%+": 64,
    "PREFLOP|BB|RAISE|ALL_IN": 65,
    "PREFLOP|BB|ALL_IN": 66,
    "FLOP|SB|FOLD": 67,
    "FLOP|SB|CHECK": 68,
    "FLOP|SB|CALL": 69,
    "FLOP|SB|BET|0-10%": 70,
    "FLOP|SB|BET|10-25%": 71,
    "FLOP|SB|BET|25-40%": 72,
    "FLOP|SB|BET|40-60%": 73,
    "FLOP|SB|BET|60-80%": 74,
    "FLOP|SB|BET|80-100%": 75,
    "FLOP|SB|BET|100-150%": 76,
    "FLOP|SB|BET|150-200%": 77,
    "FLOP|SB|BET|200-300%": 78,
    "FLOP|SB|BET|300-500%": 79,
    "FLOP|SB|BET|500%+": 80,
    "FLOP|SB|BET|ALL_IN": 81,
    "FLOP|SB|RAISE|0-10%": 82,
    "FLOP|SB|RAISE|10-25%": 83,
    "FLOP|SB|RAISE|25-40%": 84,
    "FLOP|SB|RAISE|40-60%": 85,
    "FLOP|SB|RAISE|60-80%": 86,
    "FLOP|SB|RAISE|80-100%": 87,
    "FLOP|SB|RAISE|100-150%": 88,
    "FLOP|SB|RAISE|150-200%": 89,
    "FLOP|SB|RAISE|200-300%": 90,
    "FLOP|SB|RAISE|300-500%": 91,
    "FLOP|SB|RAISE|500%+": 92,
    "FLOP|SB|RAISE|ALL_IN": 93,
    "FLOP|SB|ALL_IN": 94,
    "FLOP|BB|FOLD": 95,
    "FLOP|BB|CHECK": 96,
    "FLOP|BB|CALL": 97,
    "FLOP|BB|BET|0-10%": 98,
    "FLOP|BB|BET|10-25%": 99,
    "FLOP|BB|BET|25-40%": 100,
    "FLOP|BB|BET|40-60%": 101,
    "FLOP|BB|BET|60-80%": 102,
    "FLOP|BB|BET|80-100%": 103,
    "FLOP|BB|BET|100-150%": 104,
    "FLOP|BB|BET|150-200%": 105,
    "FLOP|BB|BET|200-300%": 106,
    "FLOP|BB|BET|300-500%": 107,
    "FLOP|BB|BET|500%+": 108,
    "FLOP|BB|BET|ALL_IN": 109,
    "FLOP|BB|RAISE|0-10%": 110,
    "FLOP|BB|RAISE|10-25%": 111,
    "FLOP|BB|RAISE|25-40%": 112,
    "FLOP|BB|RAISE|40-60%": 113,
    "FLOP|BB|RAISE|60-80%": 114,
    "FLOP|BB|RAISE|80-100%": 115,
    "FLOP|BB|RAISE|100-150%": 116,
    "FLOP|BB|RAISE|150-200%": 117,
    "FLOP|BB|RAISE|200-300%": 118,
    "FLOP|BB|RAISE|300-500%": 119,
    "FLOP|BB|RAISE|500%+": 120,
    "FLOP|BB|RAISE|ALL_IN": 121,
    "FLOP|BB|ALL_IN": 122,
    "TURN|SB|FOLD": 123,
    "TURN|SB|CHECK": 124,
    "TURN|SB|CALL": 125,
    "TURN|SB|BET|0-10%": 126,
    "TURN|SB|BET|10-25%": 127,
    "TURN|SB|BET|25-40%": 128,
    "TURN|SB|BET|40-60%": 129,
    "TURN|SB|BET|60-80%": 130,
    "TURN|SB|BET|80-100%": 131,
    "TURN|SB|BET|100-150%": 132,
    "TURN|SB|BET|150-200%": 133,
    "TURN|SB|BET|200-300%": 134,
    "TURN|SB|BET|300-500%": 135,
    "TURN|SB|BET|500%+": 136,
    "TURN|SB|BET|ALL_IN": 137,
    "TURN|SB|RAISE|0-10%": 138,
    "TURN|SB|RAISE|10-25%": 139,
    "TURN|SB|RAISE|25-40%": 140,
    "TURN|SB|RAISE|40-60%": 141,
    "TURN|SB|RAISE|60-80%": 142,
    "TURN|SB|RAISE|80-100%": 143,
    "TURN|SB|RAISE|100-150%": 144,
    "TURN|SB|RAISE|150-200%": 145,
    "TURN|SB|RAISE|200-300%": 146,
    "TURN|SB|RAISE|300-500%": 147,
    "TURN|SB|RAISE|500%+": 148,
    "TURN|SB|RAISE|ALL_IN": 149,
    "TURN|SB|ALL_IN": 150,
    "TURN|BB|FOLD": 151,
    "TURN|BB|CHECK": 152,
    "TURN|BB|CALL": 153,
    "TURN|BB|BET|0-10%": 154,
    "TURN|BB|BET|10-25%": 155,
    "TURN|BB|BET|25-40%": 156,
    "TURN|BB|BET|40-60%": 157,
    "TURN|BB|BET|60-80%": 158,
    "TURN|BB|BET|80-100%": 159,
    "TURN|BB|BET|100-150%": 160,
    "TURN|BB|BET|150-200%": 161,
    "TURN|BB|BET|200-300%": 162,
    "TURN|BB|BET|300-500%": 163,
    "TURN|BB|BET|500%+": 164,
    "TURN|BB|BET|ALL_IN": 165,
    "TURN|BB|RAISE|0-10%": 166,
    "TURN|BB|RAISE|10-25%": 167,
    "TURN|BB|RAISE|25-40%": 168,
    "TURN|BB|RAISE|40-60%": 169,
    "TURN|BB|RAISE|60-80%": 170,
    "TURN|BB|RAISE|80-100%": 171,
    "TURN|BB|RAISE|100-150%": 172,
    "TURN|BB|RAISE|150-200%": 173,
    "TURN|BB|RAISE|200-300%": 174,
    "TURN|BB|RAISE|300-500%": 175,
    "TURN|BB|RAISE|500%+": 176,
    "TURN|BB|RAISE|ALL_IN": 177,
    "TURN|BB|ALL_IN": 178,
    "RIVER|SB|FOLD": 179,
    "RIVER|SB|CHECK": 180,
    "RIVER|SB|CALL": 181,
    "RIVER|SB|BET|0-10%": 182,
    "RIVER|SB|BET|10-25%": 183,
    "RIVER|SB|BET|25-40%": 184,
    "RIVER|SB|BET|40-60%": 185,
    "RIVER|SB|BET|60-80%": 186,
    "RIVER|SB|BET|80-100%": 187,
    "RIVER|SB|BET|100-150%": 188,
    "RIVER|SB|BET|150-200%": 189,
    "RIVER|SB|BET|200-300%": 190,
    "RIVER|SB|BET|300-500%": 191,
    "RIVER|SB|BET|500%+": 192,
    "RIVER|SB|BET|ALL_IN": 193,
    "RIVER|SB|RAISE|0-10%": 194,
    "RIVER|SB|RAISE|10-25%": 195,
    "RIVER|SB|RAISE|25-40%": 196,
    "RIVER|SB|RAISE|40-60%": 197,
    "RIVER|SB|RAISE|60-80%": 198,
    "RIVER|SB|RAISE|80-100%": 199,
    "RIVER|SB|RAISE|100-150%": 200,
    "RIVER|SB|RAISE|150-200%": 201,
    "RIVER|SB|RAISE|200-300%": 202,
    "RIVER|SB|RAISE|300-500%": 203,
    "RIVER|SB|RAISE|500%+": 204,
    "RIVER|SB|RAISE|ALL_IN": 205,
    "RIVER|SB|ALL_IN": 206,
    "RIVER|BB|FOLD": 207,
    "RIVER|BB|CHECK": 208,
    "RIVER|BB|CALL": 209,
    "RIVER|BB|BET|0-10%": 210,
    "RIVER|BB|BET|10-25%": 211,
    "RIVER|BB|BET|25-40%": 212,
    "RIVER|BB|BET|40-60%": 213,
    "RIVER|BB|BET|60-80%": 214,
    "RIVER|BB|BET|80-100%": 215,
    "RIVER|BB|BET|100-150%": 216,
    "RIVER|BB|BET|150-200%": 217,
    "RIVER|BB|BET|200-300%": 218,
    "RIVER|BB|BET|300-500%": 219,
    "RIVER|BB|BET|500%+": 220,
    "RIVER|BB|BET|ALL_IN": 221,
    "RIVER|BB|RAISE|0-10%": 222,
    "RIVER|BB|RAISE|10-25%": 223,
    "RIVER|BB|RAISE|25-40%": 224,
    "RIVER|BB|RAISE|40-60%": 225,
    "RIVER|BB|RAISE|60-80%": 226,
    "RIVER|BB|RAISE|80-100%": 227,
    "RIVER|BB|RAISE|100-150%": 228,
    "RIVER|BB|RAISE|150-200%": 229,
    "RIVER|BB|RAISE|200-300%": 230,
    "RIVER|BB|RAISE|300-500%": 231,
    "RIVER|BB|RAISE|500%+": 232,
    "RIVER|BB|RAISE|ALL_IN": 233,
    "RIVER|BB|ALL_IN": 234
  },
  "config_path": "configs/tokenizer.yaml"
}
